content-org/all-posts.org
#+setupfile: setup.org
#+hugo_section: post
#+seq_todo: TODO DRAFT DONE
#+hugo_front_matter_key_replace: lastmod>mylastmod
#+macro: unsplash @@hugo:{{< unsplash leading="$1" id="$2" name="$3" >}}@@
#+macro: pixabay @@hugo:{{< pixabay >}}$1{{< /pixabay >}}@@
#+macro: pexels @@hugo:{{< pexels leading="$1" id="$2" name="$3">}}@@
#+macro: lastmod @@hugo:{{< lastmod >}}@@

** DONE #MadeWithAcademic                                 :academic:ox_hugo:
:PROPERTIES:
:EXPORT_HUGO_BUNDLE: 2020-01-06_academic
:EXPORT_HUGO_SLUG: made-with-academic
:EXPORT_FILE_NAME: index
:EXPORT_DATE: 2020-01-06
:EXPORT_HUGO_ALIASES: /2019/01/made-with-academic/
:END:

[[https://github.com/digitalcraftsman/hugo-icarus-theme][Icarus]] がメンテされておらず Hugo 0.55.0 以降で正しく動かなくなっていたので、
自力で Icarus にパッチを充てるか、別のテーマに乗り換えるかという選択を迫られていた。

せっかくなのでランディングページとブログを別にしたかったので、そういう柔軟性を備えている
[[https://sourcethemes.com/academic/][Academic]] というテーマを使うことにした。

テーマの変更にあたって様々な知見が得られたので、そのうち記事にしたい。

以下その候補:

- [[https://gohugo.io/content-management/page-bundles/][Page Bundles]] への移行
- [[https://ox-hugo.scripter.co/doc/why-ox-hugo/][ox-hugo]] と Academic が如何に相性がよいか
  - auto weight あたりが最高
  - =lastmod= の自動更新や [[https://ox-hugo.scripter.co/doc/custom-front-matter/#front-matter-extra][Front-matter Extra]] は Academic じゃなても最高の体験
- カスタムウィジェットの作り方
- ダークテーマ対応のシンタックスハイライトのやりかた
- conf-toml-mode を [[https://ox-hugo.scripter.co/doc/custom-front-matter/#front-matter-extra][Front-matter Extra]] で使う方法

